//DIVBY0 JOB 'DIVBY0',CLASS=A,MSGCLASS=H, REGION=0M                     00010003
//******************************************************************    00020102
//* PGM DIVBY0 WILL CREATE A DIV BY ZERO RUNTIME ERROR                  00020202
//******************************************************************    00020602
//STEP2    EXEC PGM=DIVBY0                                              00030001
//SYSOUT DD SYSOUT=*                                                    00050000
/*                                                                      00150001
