//WWCZXLCL JOB 'HELLO',CLASS=A,MSGCLASS=H,   
//             REGION=0M,NOTIFY=WWCZXL       
//CL       EXEC PGM=HELLO                 
//STEPLIB  DD DSN=WWCZXL.LOADLIB,DISP=SHR    
//SYSOUT DD SYSOUT=*                         