//SYNTXERR JOB 'SYNTXERR',CLASS=A,MSGCLASS=H,REGION=0M                  00010003
//******************************************************************    00020102
//* THIS JOB HAS A SYNTAX ERROR: PRGM -> PGM                            00020202
//******************************************************************    00020602
//STEP1    EXEC PRGM=IDCAMS                                             00021001
//SYSOUT   DD  SYSOUT=*                                                 00023000
//SYSIN    DD  *                                                        00024000
  DEFINE CLUSTER(NAME(WWCZXL.EMP.CLUSTER)   -                           00025000
/*                                                                      00150001
